Public Attributes | List of all members
API_StairPolylineEdgeData Struct Reference
Element Manager API
Stores data of a stair polyline edge. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_StairPolyTypeID  | type
The type of the boundary polyline section.
API_StairPolyGeometryTypeID  | geometryType
The geometry type of the boundary polyline section.
UInt32  | subElemId
The subelement identifier of the boundary polyline section.
bool  | isTop
The section describes the top of the subelement.
bool  | isBottom
The section describes the bottom of the subelement.
bool  | isFront
The section describes the front of the subelement.
bool  | isBack
The section describes the back of the subelement.
UInt32  | customId
Internal identifier.
API_StairSegmentTypeID  | segmentType
Type of the segment described by this edge: |APIST_StepsSegment|Step segment.| |APIST_LandingSegment|Landing segment.| |APIST_DividedLandingSegment|Divided landing segment.|.
bool  | isLocked
If true, edge is locked.
Detailed Description
Stores data of a stair polyline edge.
Member Data Documentation
◆ customId
 API_StairPolylineEdgeData::customId
Internal identifier.
◆ geometryType
 API_StairPolylineEdgeData::geometryType
The geometry type of the boundary polyline section.
◆ isBack
 API_StairPolylineEdgeData::isBack
The section describes the back of the subelement.
◆ isBottom
 API_StairPolylineEdgeData::isBottom
The section describes the bottom of the subelement.
◆ isFront
 API_StairPolylineEdgeData::isFront
The section describes the front of the subelement.
◆ isLocked
 API_StairPolylineEdgeData::isLocked
If true, edge is locked.
◆ isTop
 API_StairPolylineEdgeData::isTop
The section describes the top of the subelement.
◆ segmentType
 API_StairPolylineEdgeData::segmentType
Type of the segment described by this edge: |APIST_StepsSegment|Step segment.| |APIST_LandingSegment|Landing segment.| |APIST_DividedLandingSegment|Divided landing segment.|.
◆ subElemId
 API_StairPolylineEdgeData::subElemId
The subelement identifier of the boundary polyline section.
◆ type
 API_StairPolylineEdgeData::type
The type of the boundary polyline section.